app/views/movies/_movie_form.html.erb

  <%= f.text_field :title %>
  Cinema: <%= f.collection_select(:cinema_name, Cinema.all, :id, :name, prompt: true)%>
  Viewer: <%= f.collection_select(:viewer_name, Viewer.all, :id, :first_name, prompt: true)%>
---
SELECT "cinemas".* FROM "cinemas"
SELECT "viewers".* FROM "viewers"