app/controllers/cinemas_controller.rb

SELECT "cinemas".* FROM "cinemas"
---
  def index
    @cinemas = Cinema.all

INSERT INTO "cinemas" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fred"], ["created_at", "2019-02-04 01:48:28.329778"], ["updated_at", "2019-02-04 01:48:28.329778"]]
---
  def create
    cinema = Cinema.create(cinema_params)

UPDATE "cinemas" SET "name" = ?, "updated_at" = ? WHERE "cinemas"."id" = ?  [["name", "Gallery Center"], ["updated_at", "2019-02-04 16:02:28.259033"], ["id", 2]]
---
  def update
    @cinema.update(cinema_params)

DELETE FROM "cinemas" WHERE "cinemas"."id" = ?  [["id", 4]]
---
  def destroy
    Cinema.destroy(params[:id])

SELECT  "cinemas".* FROM "cinemas" WHERE "cinemas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_cinema
    @cinema = Cinema.find(params[:id])