app/controllers/movies_controller.rb

  def create
    movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("title", "created_at", "updated_at", "viewer_id", "cinema_id") VALUES (?, ?, ?, ?, ?)  [["title", "Nightmare about Code"], ["created_at", "2019-02-04 03:51:07.688905"], ["updated_at", "2019-02-04 03:51:07.688905"], ["viewer_id", 5], ["cinema_id", 2]]