app/controllers/viewers_controller.rb

SELECT "viewers".* FROM "viewers"
---
  def index
    @viewers = Viewer.all

INSERT INTO "viewers" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Shloppa"], ["last_name", "Roop"], ["created_at", "2019-02-04 02:47:16.532879"], ["updated_at", "2019-02-04 02:47:16.532879"]]
---
  def create
    viewer = Viewer.create(viewer_params)

UPDATE "viewers" SET "first_name" = ?, "updated_at" = ? WHERE "viewers"."id" = ?  [["first_name", "Rubin"], ["updated_at", "2019-02-04 16:04:34.305474"], ["id", 8]]
---
  def update
    @viewer.update(viewer_params)

DELETE FROM "viewers" WHERE "viewers"."id" = ?  [["id", 3]]
---
  def destroy
    Viewer.destroy(params[:id])

SELECT  "viewers".* FROM "viewers" WHERE "viewers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_viewer
    @viewer = Viewer.find(params[:id])