app/models/movie.rb

  def viewer_name=(name)
    self.viewer = Viewer.find_or_create_by(first_name: name)
---
SELECT  "viewers".* FROM "viewers" WHERE "viewers"."first_name" = ? LIMIT ?  [["first_name", "Serven"], ["LIMIT", 1]]

  def viewer_name
    self.viewer ? self.viewer.first_name : nil
---
SELECT  "viewers".* FROM "viewers" WHERE "viewers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def cinema_name=(name)
    self.cinema = Cinema.find_or_create_by(name: name)
---
SELECT  "cinemas".* FROM "cinemas" WHERE "cinemas"."name" = ? LIMIT ?  [["name", "fuzzy"], ["LIMIT", 1]]